In [1]:
#Programmer:Vishwanjali Kadam
#College:Keysrone School Of Engineering
#Class:TE Comp
#Roll no:48

In [2]:
#pandas ->Structure data analytics
import pandas as pd
#numpy -> array operations
import numpy as np

ARRAY

In [3]:
num=np.array((34,12,15,37,45,65,28,46), dtype=np.int16)

In [4]:
num

array([34, 12, 15, 37, 45, 65, 28, 46], dtype=int16)

In [5]:
type(num)

numpy.ndarray

In [6]:
num.dtype

dtype('int16')

In [7]:
num[2]

15

SERIES

In [8]:
s=pd.Series([45,12,52,69,42,45,78],index=range(100,107))

In [9]:
s

100    45
101    12
102    52
103    69
104    42
105    45
106    78
dtype: int64

In [14]:
type(s)

pandas.core.series.Series

In [15]:
s.dtype

dtype('int64')

In [16]:
s.size

7

In [17]:
s.shape

(7,)

In [18]:
s[105]

45

DATA FORMS

In [20]:
r=pd.Series([1,2,3,4,5])
n=pd.Series(['vishwa','raj','anushka','Tejal'])
m=pd.Series([52,64,85,47,56])

In [21]:
df=pd.DataFrame({
    'roll no':r,
    'name':n,
    'marks':m
})

In [22]:
df

   roll no     name  marks
0        1   vishwa     52
1        2      raj     64
2        3  anushka     85
3        4    Tejal     47
4        5      NaN     56

In [23]:
df.shape

(5, 3)

In [24]:
df.size

15

In [25]:
df.dtypes

roll no     int64
name       object
marks       int64
dtype: object

In [26]:
type(df)

pandas.core.frame.DataFrame

STRUCTURE DATA ANALYTICS

In [27]:
#Download all the dataset whose name start with student...
#from below link store in current
#http://,mitu.co.in.dataset

In [28]:
import os
os.getcwd()

'C:\\Users\\kadam\\OneDrive\\Desktop\\DataScience'

IMPORT THE DATA

In [31]:
df1=pd.read_csv('student1.csv')

In [32]:
df1

    1     anil  TE  56.77  22
0   2     amit  TE  59.77  21
1   3   aniket  BE  76.88  19
2   4  ajinkya  TE  69.66  20
3   5     asha  TE  63.28  20
4   6   ayesha  BE  49.55  20
5   7     amar  BE  65.34  19
6   8    amita  BE  68.33  23
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21

In [33]:
cols=['A','B','C','D','E']

In [43]:
df3=pd.read_csv('student3.tsv')

In [44]:
df3

  roll\tname\tclass\tmarks\tage
0        1\tanil\tTE\t56.77\t22
1        2\tamit\tTE\t59.77\t21
2      3\taniket\tBE\t76.88\t19
3     4\tajinkya\tTE\t69.66\t20
4        5\tasha\tTE\t63.28\t20
5      6\tayesha\tBE\t49.55\t20
6        7\tamar\tBE\t65.34\t19
7       8\tamita\tBE\t68.33\t23
8        9\tamol\tTE\t56.75\t20
9      10\tanmol\tBE\t78.66\t21

In [46]:
df3=pd.read_csv('student3.tsv',sep='\t')
df3

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [47]:
#read from link
df2=pd.read_csv('https://gist.githubusercontent.com/justimchung/9b98c69b30600a46daa6d2e827c31b56/raw/4b1f08ba9b00a2fcd3f7ced9cf9e59062f489c3a/student.csv')

In [48]:
df2

  Unnamed: 0    Name  height  weight  sex       bdate       city major
0   s1234567   Peter   175.0   70.45    1   1980/4/30     Tainan  CSIE
1   e1234567    Mary   163.0   55.00    2  1981/12/21     Taipei    EE
2   f1357689    John   180.4   80.30    1   1980/5/30     Tainan  Stat
3   e1374659   Keven   182.5   77.60    1  1980/11/19     Taipei    EE
4   s7758347    JoJo   170.3   50.30    2   1980/1/27     Taipei  CSIE
5   s1334987   Emily   168.5   53.60    2  1982/10/13  Kaohsiung  CSIE
6   e1384726  Ubuntu   177.0   68.30    1    1981/7/6  Kaohsiung    EE

In [49]:
dfx=pd.read_excel('student.xlsx')
dfx

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

USING THE DATAFRAMES OBJECT ATTRIBUTES

In [50]:
df.shape

(5, 3)

In [51]:
df.size

15

In [53]:
df.columns

Index(['roll no', 'name', 'marks'], dtype='object')

In [54]:
df.dtypes

roll no     int64
name       object
marks       int64
dtype: object

In [55]:
df.ndim

2

In [56]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [57]:
df.T

              0    1        2      3    4
roll no       1    2        3      4    5
name     vishwa  raj  anushka  Tejal  NaN
marks        52   64       85     47   56

FUNCTIONS OR METHODS

In [58]:
df.head(3)

   roll no     name  marks
0        1   vishwa     52
1        2      raj     64
2        3  anushka     85

In [59]:
df.tail()

   roll no     name  marks
0        1   vishwa     52
1        2      raj     64
2        3  anushka     85
3        4    Tejal     47
4        5      NaN     56